stenmo/AkvaLink/sdkconfig.defaults
# sdkconfig defaults for NORA-W40 Matter Thermometer (Matter-over-Thread, SED).
#
# Default build = Sleepy End Device targeting **~1 year on a coin cell**:
#   - Thread MTD (Minimal Thread Device, no routing)
#   - Sleepy mode (radio off most of the time)
#   - Wi-Fi station disabled (saves ~150 µA + a *huge* code-size cut)
#   - DS18B20 sampled every 10 s by default; bump to 60 s for max battery life
#
# Want plain Wi-Fi instead (no Thread BR available, or want a Home Assistant /
# custom app target)? Use the alternate defaults file:
#   idf.py -DSDKCONFIG_DEFAULTS="sdkconfig.defaults;sdkconfig.defaults.wifi" reconfigure
# See `sdkconfig.defaults.wifi` and the README for the trade-offs.

# --- Target & toolchain ------------------------------------------------------
CONFIG_IDF_TARGET="esp32c6"
CONFIG_FREERTOS_HZ=1000

# --- Flash & partitions ------------------------------------------------------
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="4MB"
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"

# --- Matter / esp-matter -----------------------------------------------------
CONFIG_USE_ESP_MATTER_DATA_MODEL=y
CONFIG_ESP_MATTER_NVS_PART_NAME="nvs"
CONFIG_CHIP_PROJECT_CONFIG="main/CHIPProjectConfig.h"

# CRITICAL for Matter-over-Thread: must use PLATFORM mDNS, not minimal.
# Minimal mDNS tries to UDP-multicast directly on every netif. On a Thread-only
# device the Apple/Google controller is on Wi-Fi, so it never sees the
# multicast — operational discovery silently fails with
# "chip[DIS]: Failed to advertise records: 46" (CHIP_ERROR_INVALID_ADDRESS),
# CASE never starts, and the failsafe expires → fabric reverted.
# Platform mDNS routes Thread services through SRP_CLIENT to the Border Router,
# which republishes them as real mDNS on Wi-Fi — that's the supported path.
CONFIG_USE_MINIMAL_MDNS=n

# Matter Temperature Sensor device type
CONFIG_DEVICE_TYPE_ESP32_TEMPERATURE_SENSOR=y

# Matter network: Thread, NOT Wi-Fi
CONFIG_ENABLE_CHIPOBLE=y
CONFIG_OPENTHREAD_ENABLED=y
CONFIG_OPENTHREAD_MTD=y
CONFIG_OPENTHREAD_FTD=n
CONFIG_OPENTHREAD_RADIO=n
CONFIG_OPENTHREAD_SRP_CLIENT=y
CONFIG_OPENTHREAD_DNS_CLIENT=y
CONFIG_OPENTHREAD_JOINER=y
CONFIG_OPENTHREAD_COMMISSIONER=n

# --- Sleepy End Device (battery-friendly) ------------------------------------
# MLE child timeout = how long the parent keeps polled messages for us.
# Default 240 s ≈ Apple Home recommended; raise (up to 1800 s) for slower
# wake but lower average current. Poll period 120 s = ~3 wakeups/min.
CONFIG_OPENTHREAD_DEVICE_TYPE_SLEEPY_END_DEVICE=y
CONFIG_OPENTHREAD_POLL_PERIOD_MS=120000
CONFIG_OPENTHREAD_CHILD_TIMEOUT_S=240
CONFIG_PM_ENABLE=y
CONFIG_PM_DFS_INIT_AUTO=y
CONFIG_PM_POWER_DOWN_CPU_IN_LIGHT_SLEEP=y
CONFIG_PM_POWER_DOWN_PERIPHERAL_IN_LIGHT_SLEEP=y
CONFIG_PM_SLP_DISABLE_GPIO=y
CONFIG_ESP_SLEEP_POWER_DOWN_FLASH=y
CONFIG_FREERTOS_USE_TICKLESS_IDLE=y
CONFIG_FREERTOS_IDLE_TIME_BEFORE_SLEEP=2

# --- Vendor / Product (test values — replace before CSA submission) ----------
CONFIG_DEVICE_VENDOR_ID=0xFFF1
CONFIG_DEVICE_PRODUCT_ID=0x8011
CONFIG_DEVICE_PRODUCT_NAME="u-blox NORA-W40 Thermometer"
CONFIG_DEVICE_MANUFACTURER_NAME="u-blox"

# --- Wi-Fi (DISABLED for Matter-over-Thread) ---------------------------------
CONFIG_ENABLE_WIFI_STATION=n
CONFIG_ESP_WIFI_SOFTAP_SUPPORT=n

# --- BLE (commissioning only — turned off after Matter onboarding) -----------
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_NIMBLE_EXT_ADV=n

# --- Logging -----------------------------------------------------------------
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_MAXIMUM_LEVEL_DEBUG=y

# --- Pthread / C++ -----------------------------------------------------------
CONFIG_PTHREAD_TASK_STACK_SIZE_DEFAULT=4096
CONFIG_COMPILER_CXX_EXCEPTIONS=y

# --- mbedTLS (Matter + OpenThread MeshCoP require) ---------------------------
CONFIG_MBEDTLS_HKDF_C=y
CONFIG_MBEDTLS_ECP_DP_SECP256R1_ENABLED=y
CONFIG_MBEDTLS_ECDSA_C=y
CONFIG_MBEDTLS_ECDH_C=y
CONFIG_MBEDTLS_ECP_C=y
# DTLS + EC-JPAKE — OpenThread MeshCoP / Thread commissioning requires these.
# Symptom if missing: openthread/src/core/meshcop/secure_transport.cpp fails
# to find mbedtls_ssl_conf_handshake_timeout / mbedtls_ssl_conf_dtls_cookies /
# mbedtls_ssl_set_hs_ecjpake_password / mbedtls_ssl_set_client_transport_id.
CONFIG_MBEDTLS_SSL_PROTO_DTLS=y
CONFIG_MBEDTLS_SSL_DTLS_SRTP=n
CONFIG_MBEDTLS_KEY_EXCHANGE_ECJPAKE=y
CONFIG_MBEDTLS_ECJPAKE_C=y

# --- LWIP / IPv6 — Thread needs MANY IPv6 addresses per netif ----------------
# Default 3 is far too few. Thread typically holds: link-local + ML-EID +
# ML-RLOC + OMR (off-mesh routable, the one Apple/CASE uses) + anycast +
# loopback. With only 3 slots, the OMR address fails to install and the
# device joins Thread but is unreachable from outside the mesh-local prefix
# → Apple Home commissioning stalls after AddNOC with
# "esp_netif_lwip: esp_netif_add_ip6_address_api(...): Failed to add ip6 address".
CONFIG_LWIP_IPV6_NUM_ADDRESSES=8
CONFIG_LWIP_IPV6_ND6_NUM_NEIGHBORS=8
CONFIG_LWIP_IPV6_ND6_NUM_PREFIXES=8

# --- Tighten image size a touch ----------------------------------------------
CONFIG_COMPILER_OPTIMIZATION_SIZE=y
CONFIG_BOOTLOADER_LOG_LEVEL_WARN=y

# --- AGGRESSIVE FLASH/RAM TRIM ------------------------------------------------
# Target: free 200-400KB flash + 20-40KB RAM by killing unused features.
# This is a Thread thermometer — no cloud, no Wi-Fi, no MQTT, no HTTP.
#
# After the IPv6 + minimal-mDNS fixes, app partition was at 1% free (1.94MB).
# These cuts give us breathing room for real product code (UI, sensor fusion,
# energy reporting, secure cert mgmt, etc.) — the whole point of "we want
# the host to be free for application logic."

# === RainMaker / ESP Insights (cloud telemetry — UNUSED) ====================
# These pull in MQTT, HTTPS, JSON, diag-data-store, encrypted-img, ~150KB total.
CONFIG_ESP_INSIGHTS_ENABLED=n
CONFIG_ESP_RMAKER_NO_CLAIM=y
CONFIG_ESP_RMAKER_USER_ID_CHECK=n

# === esp-matter optional components (UNUSED for thermometer) ================
# Bridge: only needed for multi-device aggregators (Hue-style).
# Controller: only needed if THIS device controls others.
# OTA Provider: we are an OTA Requestor, not a provider for other devices.
# RainMaker: cloud integration — we're local-only.
CONFIG_ENABLE_ESP_MATTER_CONTROLLER=n
CONFIG_ESP_MATTER_ENABLE_OTA_PROVIDER=n
CONFIG_ENABLE_ESP_MATTER_BRIDGE=n

# === Wi-Fi provisioning (UNUSED — we use Thread+BLE commissioning) ==========
CONFIG_ESP_WIFI_ENABLE_WPA3_SAE=n
CONFIG_ESP_WIFI_SOFTAP_SUPPORT=n
CONFIG_WIFI_PROV_BLE_FORCE_ENCRYPTION=n

# === HTTP/HTTPS server & client (UNUSED — Matter BDX handles OTA) ===========
# Saves ~80KB flash. Re-enable only if web config UI is added later.
CONFIG_ESP_HTTP_CLIENT_ENABLE_HTTPS=n
CONFIG_ESP_HTTPS_SERVER_ENABLE=n
CONFIG_ESP_HTTPS_OTA_ALLOW_HTTP=n

# === LWIP — Thread MTU is 1280, drop IPv4 if possible =======================
# Thread is IPv6-only. IPv4 stack costs ~30KB flash. Keep IPv4 for BLE/local
# debug for now; enable LWIP_IPV4=n later once everything works on IPv6.
CONFIG_LWIP_TCPIP_TASK_STACK_SIZE=3072
CONFIG_LWIP_TCP_SND_BUF_DEFAULT=2880
CONFIG_LWIP_TCP_WND_DEFAULT=2880
CONFIG_LWIP_TCP_MSL=15000
CONFIG_LWIP_TCP_FIN_WAIT_TIMEOUT=10000
CONFIG_LWIP_MAX_SOCKETS=8
CONFIG_LWIP_TCP_RECVMBOX_SIZE=4
CONFIG_LWIP_UDP_RECVMBOX_SIZE=4
# Thread doesn't need IGMP (IPv4 multicast). MLD6 (IPv6 multicast) stays on.
CONFIG_LWIP_IGMP_TIMERS_ONDEMAND=y

# === NimBLE — minimal config for Matter chipoBLE only =======================
# We only need GATT server during commissioning. Defaults are configured for
# generic BLE peripherals with multiple connections + central role.
CONFIG_BT_NIMBLE_MAX_CONNECTIONS=1
CONFIG_BT_NIMBLE_ROLE_CENTRAL=n
CONFIG_BT_NIMBLE_ROLE_OBSERVER=n
CONFIG_BT_NIMBLE_NVS_PERSIST=n
CONFIG_BT_NIMBLE_LOG_LEVEL_WARNING=y

# === Bootloader trim ========================================================
# Anti-rollback / secure boot disabled in dev builds (re-enable for production!)
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=n
CONFIG_BOOTLOADER_RESERVE_RTC_SIZE=0
CONFIG_BOOTLOADER_LOG_LEVEL_NONE=n

# === ESP-IDF unused features ================================================
CONFIG_ESP_GDBSTUB_ENABLED=n
CONFIG_ESP_DEBUG_OCDAWARE=n
CONFIG_ESP_TASK_WDT_INIT=y
CONFIG_ESP_TASK_WDT_PANIC=n
CONFIG_FREERTOS_USE_TRACE_FACILITY=n
CONFIG_FREERTOS_GENERATE_RUN_TIME_STATS=n
CONFIG_FREERTOS_USE_STATS_FORMATTING_FUNCTIONS=n
CONFIG_VFS_SUPPORT_TERMIOS=n
CONFIG_VFS_SUPPORT_DIR=n

# === mbedTLS unused ciphers — Matter only needs ECC+AES+SHA =================
# Saves ~40KB. Matter PASE/CASE uses P-256 + AES-CCM + SHA-256 only.
CONFIG_MBEDTLS_DES_C=n
CONFIG_MBEDTLS_BLOWFISH_C=n
CONFIG_MBEDTLS_XTEA_C=n
CONFIG_MBEDTLS_RC4_DISABLED=y
CONFIG_MBEDTLS_CAMELLIA_C=n
CONFIG_MBEDTLS_SSL_PROTO_TLS1_3=n
CONFIG_MBEDTLS_DHM_C=n
CONFIG_MBEDTLS_KEY_EXCHANGE_RSA=n
CONFIG_MBEDTLS_KEY_EXCHANGE_DHE_RSA=n
CONFIG_MBEDTLS_KEY_EXCHANGE_ECDHE_RSA=n
CONFIG_MBEDTLS_KEY_EXCHANGE_RSA_PSK=n
CONFIG_MBEDTLS_KEY_EXCHANGE_DHE_PSK=n
CONFIG_MBEDTLS_KEY_EXCHANGE_ECDHE_PSK=n
CONFIG_MBEDTLS_PEM_PARSE_C=n
CONFIG_MBEDTLS_PEM_WRITE_C=n
CONFIG_MBEDTLS_HAVE_TIME_DATE=n

# === Heap / RAM tuning =====================================================
# Default heap config wastes overhead on small allocations — Matter does many
# small allocations during cluster init.
CONFIG_HEAP_POISONING_DISABLED=y
CONFIG_HEAP_TASK_TRACKING=n
CONFIG_HEAP_USE_HOOKS=n

# === Newlib trim ===========================================================
# nano-printf saves ~25KB but loses %f, %lf. We don't print floats from ISRs.
CONFIG_NEWLIB_NANO_FORMAT=y
CONFIG_NEWLIB_STDOUT_LINE_ENDING_LF=y
